---
type: IFCExternalServiceUIData
namespace: Autodesk.Revit.UI
version: 2024
members: 8
tags: [revit-api, class]
---

# IFCExternalServiceUIData

`Autodesk.Revit.UI.IFCExternalServiceUIData` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetParentHwnd | 2023 | `public IntPtr GetParentHwnd ()` |
| Method | GetRevitElementIds | 2023 | `public IList < ElementId > GetRevitElementIds ()` |
| Property | Document | — | `public Document Document { get ; }` |
| Property | IsReset | — | `public bool IsReset { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ParamId | — | `public ElementId ParamId { get ; }` |
| Property | SelectedIFCItem | — | `public string SelectedIFCItem { get ; set ; }` |